name: "loss_comparison"
input: "data"
input_dim: 10
input_dim: 4320
input_dim: 1
input_dim: 1
input: "label"
input_dim: 10
input_dim: 4320
input_dim: 1
input_dim: 1
layer {
  name: "loss_azimuth"
  type: "SoftmaxWithViewLoss"
  bottom: "data"
  bottom: "label"
  top: "loss_azimuth"
  loss_weight: 1
  softmax_with_view_loss_param {
    bandwidth: 15
    sigma: 5
    pos_weight: 1
    neg_weight: 0
    period: 360
  }
}
